Repository: jingjc/MedMaskMac
Catalog: MedMaskMac/Localizable.xcstrings
Source language: en
Languages: zh_hans

# app.page_picker_label
source: Page
zh_hans: 页面

# common.file_count
source: %@ file(s)
zh_hans: %@ 个文件

# common.page_count
source: %@ page(s)
zh_hans: %@ 页

# common.page_title
source: Page %@
zh_hans: 第 %@ 页

# common.placeholder_region_count
source: %@ placeholder sensitive region(s)
zh_hans: %@ 个敏感区域占位

# common.region_count
source: %@ region(s)
zh_hans: %@ 个区域

# common.selected_file_regions
source: Selected file regions: %@
zh_hans: 已选文件区域数：%@

# common.supported_formats
source: Supported: %@
zh_hans: 支持格式：%@

# common.supported_later_types
source: Supported later: %@
zh_hans: 后续支持：%@

# common.total_page_count
source: %@ total page(s)
zh_hans: 共 %@ 页

# common.total_session_regions
source: Total session regions: %@
zh_hans: 当前会话区域总数：%@

# export.description
source: Review the current session, export redacted copies to a local folder, and inspect any per-file failures.
zh_hans: 查看当前会话，向本地文件夹导出脱敏副本，并检查各文件的失败原因。

# export.destination_panel.message
source: Choose a folder for the current session's redacted copies.
zh_hans: 为当前会话的脱敏副本选择一个文件夹。

# export.destination_panel.prompt
source: Choose Folder
zh_hans: 选择文件夹

# export.destination_panel.title
source: Choose Export Folder
zh_hans: 选择导出文件夹

# export.destination_path
source: Destination: %@
zh_hans: 目标位置：%@

# export.export_button
source: Export Redacted Copy
zh_hans: 导出脱敏副本

# export.failure_count
source: Failed exports: %@
zh_hans: 失败导出数：%@

# export.failure.destination_not_directory
source: The selected destination is not a folder.
zh_hans: 所选目标位置不是文件夹。

# export.failure.image_encoding_unavailable
source: The redacted image could not be encoded for export.
zh_hans: 无法将脱敏后的图像编码为导出文件。

# export.failure.image_unavailable
source: The image source could not be loaded.
zh_hans: 无法加载图像源文件。

# export.failure.pdf_page_unavailable
source: PDF page %@ could not be rasterized.
zh_hans: 无法栅格化 PDF 第 %@ 页。

# export.failure.pdf_unavailable
source: The PDF source could not be loaded.
zh_hans: 无法加载 PDF 源文件。

# export.failure.source_unavailable
source: The source file is no longer available.
zh_hans: 源文件已不可用。

# export.failure.write_failed
source: The exported file could not be written to the destination folder.
zh_hans: 无法将导出文件写入目标文件夹。

# export.failures_subtitle
source: These files did not export successfully.
zh_hans: 这些文件未能成功导出。

# export.failures_title
source: Failed Files
zh_hans: 失败文件

# export.fixed_pdf_resolution
source: PDF pages export as rasterized 200 DPI pages
zh_hans: PDF 页面将以 200 DPI 的栅格页面导出

# export.local_destination_only
source: Choose a local folder destination with no persistence
zh_hans: 选择本地文件夹作为目标，且不会持久保存会话

# export.no_results_yet
source: No export has run in this session yet.
zh_hans: 当前会话尚未执行导出。

# export.open_folder
source: Open Output Folder
zh_hans: 打开输出文件夹

# export.original_unchanged
source: Original files remain unchanged
zh_hans: 原始文件保持不变

# export.prepared_title
source: Prepared Session
zh_hans: 已准备会话

# export.ready_subtitle
source: Choose a destination folder to export redacted copies for the current session.
zh_hans: 选择目标文件夹，为当前会话导出脱敏副本。

# export.ready_title
source: Ready To Export
zh_hans: 准备导出

# export.results_subtitle
source: Latest export result for the current in-memory session.
zh_hans: 当前内存会话的最近一次导出结果。

# export.results_title
source: Last Export Result
zh_hans: 最近导出结果

# export.success_count
source: Successful exports: %@
zh_hans: 成功导出数：%@

# export.title
source: Export Summary
zh_hans: 导出摘要

# file_kind.image
source: Image
zh_hans: 图像

# file_status.imported
source: Imported
zh_hans: 已导入

# file_status.needs_attention
source: Needs Attention
zh_hans: 需注意

# file_status.ready_for_review
source: Ready For Review
zh_hans: 可审核

# import.card.session_seed_subtitle
source: Imported files remain in memory for the current session only.
zh_hans: 导入的文件仅保留在当前会话内存中。

# import.card.session_seed_title
source: Imported Files
zh_hans: 已导入文件

# import.card.title
source: Import Files
zh_hans: 导入文件

# import.choose_files
source: Choose Files
zh_hans: 选择文件

# import.description
source: Choose local PDF or image files to load them into the current session.
zh_hans: 选择本地 PDF 或图像文件并加载到当前会话中。

# import.error.empty_pdf
source: "%@" has no readable pages.
zh_hans: "%@" 没有可读取的页面。

# import.error.unreadable_file
source: Could not import "%@".
zh_hans: 无法导入 "%@"。

# import.go_to_review
source: Go to Review / Edit
zh_hans: 前往审核 / 编辑

# import.local_first
source: Local-only session
zh_hans: 仅本地会话

# import.no_background
source: Current-page OCR runs only when requested
zh_hans: 仅在你请求时识别当前页面

# import.panel.message
source: Choose one or more PDF or image files to load into this session.
zh_hans: 选择一个或多个 PDF 或图像文件并加载到当前会话。

# import.panel.title
source: Import Files
zh_hans: 导入文件

# import.summary.counts
source: %1$@ file(s) • %2$@ total page(s)
zh_hans: %1$@ 个文件 • 共 %2$@ 页

# import.summary.empty
source: No files imported yet.
zh_hans: 尚未导入任何文件。

# import.summary.session_only
source: Imported files remain in memory for the current session only.
zh_hans: 导入的文件仅保留在当前会话内存中。

# import.title
source: Import Page
zh_hans: 导入页面

# nav.export.subtitle
source: Review export results for the current session and open the output folder.
zh_hans: 查看当前会话的导出结果并打开输出文件夹。

# nav.export.title
source: Export Summary
zh_hans: 导出摘要

# nav.import.subtitle
source: Prepare PDFs or images for a local redaction pass.
zh_hans: 为本地脱敏流程准备 PDF 或图像。

# nav.import.title
source: Import
zh_hans: 导入

# nav.review.subtitle
source: Review pages, place manual masks, and prepare the current session for export.
zh_hans: 检查页面、放置手动遮罩，并为当前会话准备导出。

# nav.review.title
source: Review / Edit
zh_hans: 审核 / 编辑

# ocr.category.address
source: Address
zh_hans: 地址

# ocr.category.age
source: Age
zh_hans: 年龄

# ocr.category.birthday
source: Birthday
zh_hans: 生日

# ocr.category.bed_number
source: Bed Number
zh_hans: 床号

# ocr.category.chinese_id
source: Chinese ID
zh_hans: 身份证号

# ocr.category.custom
source: Custom
zh_hans: 自定义

# ocr.category.date
source: Date
zh_hans: 日期

# ocr.category.exam_date
source: Exam Date
zh_hans: 检查日期

# ocr.category.department
source: Department
zh_hans: 科室

# ocr.category.doctor
source: Doctor
zh_hans: 医生

# ocr.category.staff_signature
source: Staff / Signature
zh_hans: 工作人员/签名

# ocr.category.document_number
source: Document Number
zh_hans: 证件号

# ocr.category.email
source: Email
zh_hans: 电子邮件

# ocr.category.fax
source: Fax
zh_hans: 传真

# ocr.category.hospital
source: Hospital
zh_hans: 医院

# ocr.category.medical_number
source: Medical Number
zh_hans: 医疗编号

# ocr.category.name
source: Name
zh_hans: 姓名

# ocr.category.phone
source: Phone
zh_hans: 手机号

# ocr.category.sex
source: Sex
zh_hans: 性别

# ocr.category.unknown
source: Unknown
zh_hans: 未知

# page_status.masked_preview
source: Preview
zh_hans: 脱敏效果

# page_status.pending_detection
source: Pending Detection
zh_hans: 待检测

# page_status.ready_for_review
source: Ready For Review
zh_hans: 可审核

# preset.custom.summary
source: Uses the enabled checklist fields for OCR suggestions.
zh_hans: 根据勾选字段生成 OCR 建议。

# preset.custom.title
source: Custom Redaction
zh_hans: 自定义脱敏

# preset.custom.field.address
source: Address
zh_hans: 地址

# preset.custom.field.age
source: Age
zh_hans: 年龄

# preset.custom.field.dates
source: Dates
zh_hans: 日期

# preset.custom.field.doctor
source: Doctor
zh_hans: 医生

# preset.custom.field.staff_signature
source: Staff / Signature
zh_hans: 工作人员/签名

# preset.custom.field.email
source: Email
zh_hans: 邮箱

# preset.custom.field.hospital_department
source: Hospital/Department
zh_hans: 医院/科室

# preset.custom.field.id_number
source: ID Number
zh_hans: 身份证号

# preset.custom.field.medical_numbers
source: Medical Numbers
zh_hans: 医疗编号

# preset.custom.field.name
source: Name
zh_hans: 姓名

# preset.custom.field.phone
source: Phone
zh_hans: 手机号

# preset.custom.field.sex
source: Gender
zh_hans: 性别

# preset.standard.summary
source: Detect name, phone number, ID number, outpatient number, inpatient number, medical record number, and other core identity fields.
zh_hans: 检测姓名、手机号、身份证号、门诊号、住院号、病案号等核心身份信息。

# preset.standard.title
source: Standard Redaction
zh_hans: 标准脱敏

# preset.strict.summary
source: Adds demographics, dates, contact, facility, doctor, and bed information.
zh_hans: 额外检测人口学、日期、联系方式、机构、医生和床号信息。

# preset.strict.title
source: Strict Redaction
zh_hans: 严格脱敏

# review.canvas.delete_region
source: Delete Selected Box
zh_hans: 删除选中框

# review.canvas.manual_edit_hint
source: Drag on empty preview space to create a region. Delete removes the selected box.
zh_hans: 在空白预览区域拖拽可创建区域。按 Delete 可删除当前选中的框。

# review.canvas.masked_preview
source: Preview
zh_hans: 脱敏效果

# review.canvas.masked_preview_hint
source: Preview is view-only. Switch back to Edit to edit boxes.
zh_hans: 脱敏效果仅供查看。切回编辑后才能编辑框。

# review.canvas.no_file
source: No file selected
zh_hans: 未选择文件

# review.canvas.no_page
source: No page selected
zh_hans: 未选择页面

# review.canvas.original_preview
source: Edit
zh_hans: 编辑

# review.canvas.preview_load_failed
source: Could not load a preview for "%@".
zh_hans: 无法加载 "%@" 的预览。

# review.canvas.preview_metadata
source: %1$@ • Page %2$@ of %3$@
zh_hans: %1$@ • 第 %2$@ / %3$@ 页

# review.canvas.preview_mode
source: Preview Mode
zh_hans: 预览模式

# review.canvas.preview_placeholder
source: Select a file and page to preview.
zh_hans: 选择一个文件和页面以进行预览。

# review.canvas.preview_unavailable
source: Preview unavailable for the selected content.
zh_hans: 所选内容暂时无法预览。

# review.canvas.subtitle
source: Actual preview is shown here. Drag to create, move, resize, and delete manual regions on the selected page.
zh_hans: 这里会显示真实预览。你可以在所选页面上拖拽创建、移动、调整大小并删除手动区域。

# review.canvas.title
source: Canvas
zh_hans: 画布

# review.canvas.zoom.actual_size
source: Actual Size
zh_hans: 实际大小

# review.canvas.zoom.fit_to_width
source: Fit to Width
zh_hans: 按宽度

# review.canvas.zoom.fit_to_window
source: Fit to Window
zh_hans: 完整显示

# review.command.menu_title
source: Review
zh_hans: 审核

# review.command.next_page
source: Next Page
zh_hans: 下一页

# review.command.previous_page
source: Previous Page
zh_hans: 上一页

# review.command.redo
source: Redo
zh_hans: 重做

# review.command.show_masked
source: Show Preview
zh_hans: 显示脱敏效果

# review.command.show_original
source: Show Edit
zh_hans: 显示编辑

# review.command.undo
source: Undo
zh_hans: 撤销

# review.inspector.detection_subtitle
source: Run local OCR suggestions for the selected page only.
zh_hans: 仅对所选页面运行本地 OCR 建议。

# review.inspector.detection_title
source: Detection Status
zh_hans: 检测状态

# review.inspector.custom_preset_fields
source: Custom Fields
zh_hans: 自定义字段

# review.inspector.mask_preset
source: Mask Preset
zh_hans: 脱敏预设

# review.inspector.subtitle
source: Mask settings and current-session region counts for the selected file.
zh_hans: 所选文件的遮罩设置与当前会话区域计数。

# review.inspector.title
source: Inspector
zh_hans: 检查器

# review.ocr.action.ignore
source: Ignore
zh_hans: 忽略

# review.ocr.action.locate
source: Locate
zh_hans: 定位

# review.ocr.action.mask
source: Mask
zh_hans: 脱敏

# review.ocr.action.undo
source: Undo
zh_hans: 撤销

# review.ocr.action.unmask
source: Unmask
zh_hans: 取消脱敏

# review.ocr.detect_current_page
source: Detect Current Page
zh_hans: 识别当前页

# review.ocr.detected_items_title
source: Detected Items
zh_hans: 识别结果

# review.ocr.no_candidates
source: No sensitive items detected
zh_hans: 未识别到敏感信息

# review.ocr.no_explicit_value
source: No specific content recognized. Please check this fill-in area.
zh_hans: 未识别到具体内容，建议检查该填写区域

# review.ocr.value.region_only
source: Text was not recognized reliably. Please review the masking area.
zh_hans: 未能可靠识别文字，请复核遮盖范围

# review.ocr.value.uncertain
source: Possible: %@. Please review.
zh_hans: 可能：%@，请复核

# review.ocr.state.failed
source: OCR failed: %@
zh_hans: OCR 失败：%@

# review.ocr.state.idle
source: Idle
zh_hans: 空闲

# review.ocr.state.no_page
source: Select a file and page first.
zh_hans: 请先选择文件和页面。

# review.ocr.state.needs_rerun
source: Detection settings changed. Rerun OCR for the current page.
zh_hans: 检测设置已变更，请重新识别当前页。

# review.ocr.state.running
source: Detecting current page...
zh_hans: 正在识别当前页...

# review.ocr.state.succeeded
source: Detected %d candidate item(s) on this page.
zh_hans: 本页识别到 %d 个候选项

# review.ocr.status.ignored
source: Ignored
zh_hans: 已忽略

# review.ocr.status.masked
source: Masked
zh_hans: 已脱敏

# review.ocr.status.pending
source: Pending
zh_hans: 待处理

# review.ocr.suggestion_hint
source: OCR suggestions are normal editable boxes on the selected page.
zh_hans: OCR 建议框是所选页面上的普通可编辑框。

# review.sidebar.files_subtitle
source: Imported documents in the current session.
zh_hans: 当前会话中已导入的文档。

# review.sidebar.files_title
source: Files
zh_hans: 文件

# review.sidebar.no_files
source: No files imported yet.
zh_hans: 尚未导入任何文件。

# review.sidebar.no_pages
source: Select a file to view its pages.
zh_hans: 选择一个文件以查看其页面。

# review.sidebar.pages_subtitle
source: Pages discovered from the selected file.
zh_hans: 从所选文件中发现的页面。

# review.sidebar.pages_title
source: Pages
zh_hans: 页面

# review.sidebar.single_page_metadata
source: Single page • %1$@ • %2$@
zh_hans: 单页 • %1$@ • %2$@

# service.barcode.summary
source: Barcode and QR detection are not implemented in this V0.
zh_hans: 条码和二维码检测未在当前 V0 中实现。

# service.export.summary
source: Ready to export %1$@ with the %2$@ preset.
zh_hans: 已准备使用 %2$@ 预设导出 %1$@。

# service.file_import.guidance
source: Choose local PDF or image files. They remain in memory for this session only.
zh_hans: 选择本地 PDF 或图像文件。它们仅保留在当前会话内存中。

# service.file_import.placeholder
source: Real file picking is intentionally deferred in this phase.
zh_hans: 当前阶段刻意暂不实现真实文件选择。

# service.mask.preview_summary
source: %1$@ will burn %2$@ into preview and exported copies.
zh_hans: %1$@ 会将 %2$@ 烧录到脱敏效果和导出副本中。

# service.ocr.failure.image_unavailable
source: The image "%@" could not be prepared for OCR.
zh_hans: 无法为图像 "%@" 准备 OCR。

# service.ocr.failure.pdf_page_unavailable
source: PDF page %@ could not be prepared for OCR.
zh_hans: 无法为 PDF 第 %@ 页准备 OCR。

# service.ocr.failure.pdf_unavailable
source: The PDF "%@" could not be prepared for OCR.
zh_hans: 无法为 PDF "%@" 准备 OCR。

# service.ocr.failure.recognition_failed
source: Vision text recognition failed. %@
zh_hans: Vision 文本识别失败。%@

# service.ocr.failure.source_unavailable
source: The source file is no longer available.
zh_hans: 源文件已不可用。

# service.ocr.summary
source: Local Vision OCR is available for current-page suggestions.
zh_hans: 本地 Vision OCR 可用于当前页建议框。

# service.pdf.canvas_title
source: %@ Canvas
zh_hans: %@ 画布

# service.pdf.canvas_title_empty
source: Canvas
zh_hans: 画布
